feat: add more pattern notes
